{"Descriptions": ["- Performed process mining, implemented anomaly detection on contractual KPI metrics and optimized SLA.- Built BPM process models using event logs for Process Discovery, Conformance and Enhancement.- Built ML models to predict the time taken for a process to complete its execution. Used this to dynamically generate optimal  sequence of process execution. - Set up data pipelines using Logstash to perform ETL on event logs.- Created Power BI Dashboards to present information to stakeholders and visually monitor KPIs and insights.", "Coursework: Analytics for Business Intelligence, Business Data Management, Data Analysis and Decision Making, Business Forecasting, Multivariate Analysis, Data Visualization, Project Management, Data Science, Machine Learning, Business Analytics Programming.", "Activities and societies:", "Coursework: Database Management, Operating systems, Programming languages – C, C++, Java, Data structures and Algorithms, Computer Graphics, Management and Entrepreneurship, Computer Networks.", "Analyzed data to understand the customer purchase behavior (specifically, purchase amount) against various features like Products of different Categories, Gender, Age, Occupation of Customer, etc. And designed a simple predicting model to predict the purchase amount of customer against various products which will help creating personalized offer for customers against different products.", "Analyzed and modeled employee attrition rate and determine the most dominant contributing factors that govern this turnover. This helps the companies to understand how many employees are likely to leave, while also determining which employees are at the highest risk and for what reasons.", "Sanjana has demonstrated strong understanding for what worked and didn't work for the products she analyzed during her time in Groupon.  She focused on customer behavior to understand what pain points existed in purchase buyflows as well as provided product recommendations to address issues.  Very thoughtful and sought to always find ways to make the product resonate with customers as well as merchant providers.  Great collaborator with Product Managers, GTM Operations, and her analytical peers.", "I've had the pleasure to partner with Sanjana in my team and her determination to find root causes and explain behaviors in data is exemplary. Sanjana exhibits a ruthless focus on enhancing data-informed decision-making which is rare considering her limited tenure in analytics. Her probing has slowly gained greater focus on the outcome rather than the outputs. I see incredible potential in her for a career in analytics. Sanjana is an asset to any team. Wishing you all the best!", "Shivani is an excellent professional and is extremely hard-working. She is focused, dependable and objective-oriented. She has commendable skills in the HR field. She understands complex issues even outside of her immediate area of expertise. Besides possessing exceptional interpersonal skills, Shivani has had great relations with her stakeholders. She is not only a reliable and forward-thinking leader but also an inspiring team player."], "Titles": ["Data Analyst II - Monetization Strategy & Operations", "Product Analyst", "Product Data Analyst", "Research Assistant", "Analytics Intern", "Black Friday Sales Prediction", "Employee Attrition Analysis and Forecast", "Education Mentor", "Fundraiser"]}